app/controllers/books_controller.rb

  def create

  	@book = current_user.books.new(book_param)
  	@book.save
---
INSERT INTO "books" ("name", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "peer-e-kamil"], ["price", 450], ["user_id", 1], ["created_at", "2016-03-02 10:25:22.593755"], ["updated_at", "2016-03-02 10:25:22.593755"]]